test/files/create_invoice_response.json

{"url":"https://test2-btc-ltc.forkbitpay.ninja/invoice?id=X1U8C2BhLJ3BamgNFp4Muz","posData":null,"status":"new","btcPrice":"1.00000000","btcDue":"1.00000100","cryptoInfo":[{"cryptoCode":"BTC","paymentType":"BTCLike","rate":1.0,"exRates":{"BTC":0.0},"paid":"0.00000000","price":"1.00000000","due":"1.00000100","paymentUrls":{"BIP21":"bitcoin:tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0?amount=1.00000100","BIP72":"bitcoin:tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0?amount=1.00000100&r=https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BIP72b":"bitcoin:?r=https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BIP73":"https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BOLT11":null},"address":"tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0","url":"https://test2-btc-ltc.forkbitpay.ninja/i/BTC/X1U8C2BhLJ3BamgNFp4Muz","totalDue":"1.00000100","networkFee":"0.00000100","txCount":0,"cryptoPaid":"0.00000000"}],"price":1.0,"currency":"BTC","exRates":{"BTC":0.0},"buyerTotalBtcAmount":null,"itemDesc":null,"orderId":null,"guid":"0922aea0-649a-4c6a-af62-85d3b6dd00bf","id":"X1U8C2BhLJ3BamgNFp4Muz","invoiceTime":1535460333000,"expirationTime":1535461233000,"currentTime":1535460335747,"lowFeeDetected":false,"btcPaid":"0.00000000","rate":1.0,"exceptionStatus":false,"paymentUrls":{"BIP21":"bitcoin:tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0?amount=1.00000100","BIP72":"bitcoin:tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0?amount=1.00000100&r=https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BIP72b":"bitcoin:?r=https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BIP73":"https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BOLT11":null},"refundAddressRequestPending":false,"buyerPaidBtcMinerFee":null,"bitcoinAddress":"tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0","token":"WSKuin4qFheWauVhShCTdd","flags":{"refundable":false},"paymentSubtotals":{"BTC":100000000},"paymentTotals":{"BTC":100000100},"amountPaid":0,"minerFees":{"BTC":{"satoshisPerByte":1.0,"totalFee":100}},"exchangeRates":{"BTC":{"BTC":0.0}},"supportedTransactionCurrencies":{"BTC":{"enabled":true}},"addresses":{"BTC":"tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0"},"paymentCodes":{"BTC":{"BIP21":"bitcoin:tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0?amount=1.00000100","BIP72":"bitcoin:tb1qp2gpn6e8cv5ktmwhtkmzxygzz5h4ykgk3m3mh0?amount=1.00000100&r=https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BIP72b":"bitcoin:?r=https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BIP73":"https://test2-btc-ltc.forkbitpay.ninja/i/X1U8C2BhLJ3BamgNFp4Muz","BOLT11":null}}}